content/posts/intrinsic_motivation.md
+++
title = "intrinsic motivation"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:37:09-04:00
slug = "intrinsic_motivation"
draft = false
+++

## [free energy principle]({{< relref "free_energy_principle" >}}), [probabilistic inference]({{< relref "probabilistic_inference" >}}) {#free-energy-principle--free-energy-principle-dot-md--probabilistic-inference--probabilistic-inference-dot-md}


## [intrinsic motivation]({{< relref "intrinsic_motivation" >}}) is a unifying term for concepts like the [free energy principle]({{< relref "free_energy_principle" >}}). This is discussed in [Expanding the Active Inference Landscape More Intrinsic Motivations in the Perception-Action Loop by Martin Biehl, Daniel Polani, et al in 2018]({{< relref "Expanding_the_Active_Inference_Landscape_More_Intrinsic_Motivations_in_the_Perception-Action_Loop_by_Martin_Biehl,_Daniel_Polani,_et_al_in_2018" >}}) and associated lectures. {#intrinsic-motivation--intrinsic-motivation-dot-md--is-a-unifying-term-for-concepts-like-the-free-energy-principle--free-energy-principle-dot-md--dot-this-is-discussed-in-expanding-the-active-inference-landscape-more-intrinsic-motivations-in-the-perception-action-loop-by-martin-biehl-daniel-polani-et-al-in-2018--expanding-the-active-inference-landscape-more-intrinsic-motivations-in-the-perception-action-loop-by-martin-biehl-daniel-polani-et-al-in-2018-dot-md--and-associated-lectures-dot}


## <https://en.wikipedia.org/wiki/Intrinsic%5Fmotivation%5F(artificial%5Fintelligence)> {#https-en-dot-wikipedia-dot-org-wiki-intrinsic-motivation--artificial-intelligence}
